[
  {
    "domanda": "Internet è l'interconnessione globale tra reti, resa possibile dalla suite di protocolli TCP/IP.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Con il termine 'Internet' si intende la stessa cosa del 'World Wide Web' (WWW).",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Un Byte è l'unità elementare di informazione e corrisponde a un singolo stato (0 o 1).",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "La CPU (Central Processing Unit) è l'unità che esegue i calcoli e coordina le attività in un computer.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "La RAM è una memoria 'volatile' che mantiene i dati anche dopo lo spegnimento del computer.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Un SSD (Solid State Drive) è più veloce di un HDD (Hard Disk Drive) perché non ha parti mobili.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Una rete LAN (Local Area Network) copre l'estensione di una intera nazione.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Il protocollo HTTP con il lucchetto (HTTPS) è più sicuro di HTTP perché utilizza la crittografia SSL/TLS.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Un 'Browser' e un 'Motore di Ricerca' sono la stessa cosa.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Il browser (es. Chrome) è l'applicazione che gestisce la comunicazione con i server e compone la pagina web.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Il DNS (Domain Name System) serve a tradurre i nomi di dominio (es. google.com) negli indirizzi IP numerici.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "I motori di ricerca analizzano e indicizzano una grandissima lista di siti, un po' come fossero le pagine gialle di Internet.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "La PEC (Posta Elettronica Certificata) garantisce lo stesso valore legale di una raccomandata con avviso di ricevimento.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "L'indirizzo email si compone di un nome utente, seguito dal simbolo # e poi dal dominio.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Il campo CC (Copia Conoscenza) in una email invia il messaggio a destinatari che non vedono gli indirizzi degli altri.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Il campo CCN (Copia Conoscenza Nascosta) nasconde gli indirizzi email agli altri destinatari, tutelando la privacy.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Una casella PEC inviata a una casella email ordinaria (es. Gmail) ha pieno valore legale di notifica.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "L'Agenzia per l'Italia Digitale (AGID) è l'organo che gestisce la vigilanza sui gestori PEC autorizzati in Italia.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Il principale svantaggio della PEC è che non è riconosciuta come standard internazionale (UE).",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Il protocollo SMTP si occupa della ricezione delle email sul dispositivo, sincronizzandole tra server e client.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "I file .exe e gli allegati compressi sono sempre bloccati dai server di posta per motivi di sicurezza.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Un sito web di una società ha l'obbligo di indicare Ragione Sociale e Partita IVA nelle informazioni legali.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "La Marca Temporale ha lo scopo di estendere la validità legale di un documento firmato digitalmente nel tempo.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Per la legge, salvare una PEC sulla propria chiavetta USB garantisce la 'Conservazione a Norma'.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "La ricezione di una notifica legale via PEC si considera avvenuta solo quando il destinatario apre e legge il messaggio.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "In caso di casella PEC piena, la notifica legale si considera comunque valida per 'compiuta giacenza'.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "Lo SPID Livello 2 richiede solo l'uso di Username e Password per l'accesso ai servizi PA.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "La 'Confidentiality' (Riservatezza) è il pilastro della sicurezza che si ottiene con l'implementazione di backup e ridondanza dei sistemi.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  },
  {
    "domanda": "Un attacco di 'Phishing' simula una comunicazione di un ente fidato per indurre l'utente a inserire le credenziali su un sito web clone.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Vero"
  },
  {
    "domanda": "La navigazione in incognito del browser nasconde completamente l'attività dell'utente al provider di servizi Internet.",
    "risposte": [
      "Vero",
      "Falso"
    ],
    "corretta": "Falso"
  }
]
