[
  {
    "domanda": "Qual è la differenza tra un Bit e un Byte?",
    "risposte": [
      "Il Bit misura la velocità della CPU, il Byte la capacità del disco.",
      "Il Bit è l'unità elementare (0 o 1), il Byte è l'insieme di 8 Bit necessario per un carattere.",
      "Il Bit è volatile (RAM), il Byte è permanente (HDD)."
    ],
    "corretta": "Il Bit è l'unità elementare (0 o 1), il Byte è l'insieme di 8 Bit necessario per un carattere."
  },
  {
    "domanda": "Qual è il compito principale della RAM (Memoria Centrale) in un computer?",
    "risposte": [
      "Archiviare permanentemente tutti i file dell'utente e i programmi installati.",
      "Fungere da spazio di lavoro temporaneo e veloce per i programmi in esecuzione.",
      "Eseguire i calcoli complessi e coordinare le attività del sistema."
    ],
    "corretta": "Fungere da spazio di lavoro temporaneo e veloce per i programmi in esecuzione."
  },
  {
    "domanda": "Perché si parla di memoria 'volatile' riferendosi alla RAM?",
    "risposte": [
      "Perché può essere facilmente danneggiata da un virus.",
      "Perché mantiene i dati solo finché c'è alimentazione elettrica e si svuota allo spegnimento.",
      "Perché i dati contenuti sono accessibili solo tramite Internet."
    ],
    "corretta": "Perché mantiene i dati solo finché c'è alimentazione elettrica e si svuota allo spegnimento."
  },
  {
    "domanda": "Qual è il vantaggio principale di un SSD (Solid State Drive) rispetto a un HDD (Hard Disk Drive)?",
    "risposte": [
      "Costo molto più basso per grandi capacità di archiviazione.",
      "L'assenza di parti mobili che garantisce velocità e resistenza agli urti.",
      "L'immunità totale a qualsiasi tipo di virus informatico."
    ],
    "corretta": "L'assenza di parti mobili che garantisce velocità e resistenza agli urti."
  },
  {
    "domanda": "Qual è la differenza principale tra un algoritmo di compressione Lossless (es. ZIP) e Lossy (es. MP3)?",
    "risposte": [
      "Lossless è per i file di testo, Lossy è per i file multimediali.",
      "Lossless non perde dati e garantisce la perfetta ricostruibilità, Lossy elimina informazioni per risparmiare spazio.",
      "Lossy è gratuito, Lossless è a pagamento."
    ],
    "corretta": "Lossless non perde dati e garantisce la perfetta ricostruibilità, Lossy elimina informazioni per risparmiare spazio."
  },
  {
    "domanda": "Come si definisce una rete LAN (Local Area Network)?",
    "risposte": [
      "Una rete che copre l'estensione di una nazione o un continente.",
      "Una rete limitata a un'area geografica ristretta come una casa o un ufficio.",
      "Una rete che funziona solo tramite cavo in rame (Ethernet)."
    ],
    "corretta": "Una rete limitata a un'area geografica ristretta come una casa o un ufficio."
  },
  {
    "domanda": "Qual è la funzione del Modem, spesso integrato nel router di casa?",
    "risposte": [
      "Assegnare gli indirizzi IP ai dispositivi collegati.",
      "Tradurre il segnale fisico della linea (telefono o fibra) in segnale digitale per il computer.",
      "Gestire il traffico di tutti i dispositivi Wi-Fi."
    ],
    "corretta": "Tradurre il segnale fisico della linea (telefono o fibra) in segnale digitale per il computer."
  },
  {
    "domanda": "Perché il protocollo HTTPS è preferibile a HTTP quando si naviga online?",
    "risposte": [
      "HTTPS è più veloce e consuma meno dati.",
      "HTTPS utilizza un certificato SSL/TLS per crittografare la connessione, rendendola sicura.",
      "HTTP è usato solo per scaricare documenti, HTTPS per la visualizzazione."
    ],
    "corretta": "HTTPS utilizza un certificato SSL/TLS per crittografare la connessione, rendendola sicura."
  },
  {
    "domanda": "Qual è il compito principale del DNS (Domain Name System)?",
    "risposte": [
      "Garantire che la connessione avvenga in modo sicuro e protetto.",
      "Tradurre i nomi di dominio testuali (es. google.com) negli indirizzi IP numerici.",
      "Verificare l'identità del server remoto."
    ],
    "corretta": "Tradurre i nomi di dominio testuali (es. google.com) negli indirizzi IP numerici."
  },
  {
    "domanda": "L'Internet of Things (IoT) si riferisce a:",
    "risposte": [
      "Il modello di architettura di rete Peer-to-Peer (P2P).",
      "L'estensione della connettività Internet a oggetti fisici di uso quotidiano (es. termostati smart).",
      "Il sistema di ricerca avanzata nel Deep Web."
    ],
    "corretta": "L'estensione della connettività Internet a oggetti fisici di uso quotidiano (es. termostati smart)."
  },
  {
    "domanda": "Quale tra le seguenti affermazioni definisce il 'Deep Web'?",
    "risposte": [
      "La parte di Internet indicizzata dai motori di ricerca come Google.",
      "Una sottorete accessibile solo con software di anonimizzazione (TOR).",
      "La parte di Internet non indicizzata (es. home banking, caselle email) che è perfettamente legale."
    ],
    "corretta": "La parte di Internet non indicizzata (es. home banking, caselle email) che è perfettamente legale."
  },
  {
    "domanda": "L'obiettivo principale della SEO (Search Engine Optimization) è:",
    "risposte": [
      "Pagare Google per far apparire il proprio sito più in alto nei risultati ADS.",
      "Migliorare la visibilità di un sito web nei risultati di ricerca gratuiti (organici).",
      "Garantire che il sito sia protetto da virus e attacchi hacker."
    ],
    "corretta": "Migliorare la visibilità di un sito web nei risultati di ricerca gratuiti (organici)."
  },
  {
    "domanda": "Cosa indica l'operatore di ricerca Google con le virgolette, ad esempio: 'linee guida privacy'?",
    "risposte": [
      "Cercare una delle due parole separatamente.",
      "Cercare la frase esatta, nello stesso ordine e senza modifiche.",
      "Escludere entrambe le parole dai risultati."
    ],
    "corretta": "Cercare la frase esatta, nello stesso ordine e senza modifiche."
  },
  {
    "domanda": "Cos'è la 'Filter Bubble' (Bolla di Filtraggio)?",
    "risposte": [
      "Un software antivirus che protegge la navigazione.",
      "La tendenza degli algoritmi a mostrarti solo risultati che confermano le tue idee preesistenti, isolandoti intellettualmente.",
      "Il processo di indicizzazione dei siti web da parte dei motori di ricerca."
    ],
    "corretta": "La tendenza degli algoritmi a mostrarti solo risultati che confermano le tue idee preesistenti, isolandoti intellettualmente."
  },
  {
    "domanda": "Un file rilasciato con licenza Creative Commons 'CC BY' (Attribuzione) richiede obbligatoriamente che:",
    "risposte": [
      "L'opera non venga utilizzata per scopi commerciali.",
      "Venga citato l'autore originale, ma l'uso è libero (anche modifiche).",
      "L'opera non possa mai essere modificata."
    ],
    "corretta": "Venga citato l'autore originale, ma l'uso è libero (anche modifiche)."
  },
  {
    "domanda": "Perché è fondamentale usare il campo CCN (Copia Nascosta) quando si invia un'email a molti destinatari non conosciuti tra loro?",
    "risposte": [
      "Per assicurare che l'email venga recapitata più velocemente.",
      "Per evitare che i destinatari vedano gli indirizzi email degli altri e tutelare la loro privacy (GDPR).",
      "Per impedire che i destinatari in CCN possano rispondere all'email."
    ],
    "corretta": "Per evitare che i destinatari vedano gli indirizzi email degli altri e tutelare la loro privacy (GDPR)."
  },
  {
    "domanda": "Qual è la differenza tra la Ricevuta di Accettazione e quella di Consegna di una PEC?",
    "risposte": [
      "La Ricevuta di Accettazione certifica l'invio, quella di Consegna certifica l'avvenuto deposito nella casella del destinatario (valore legale).",
      "La Ricevuta di Consegna è la prova che il destinatario ha letto il messaggio, quella di Accettazione no.",
      "La Ricevuta di Accettazione è inviata dal destinatario, quella di Consegna dal mittente."
    ],
    "corretta": "La Ricevuta di Accettazione certifica l'invio, quella di Consegna certifica l'avvenuto deposito nella casella del destinatario (valore legale)."
  },
  {
    "domanda": "Quale problema risolve il protocollo IMAP rispetto al vecchio POP3?",
    "risposte": [
      "Permette l'invio di allegati fino a 50MB.",
      "Sincronizza lo stato della posta elettronica su tutti i dispositivi (PC, telefono).",
      "Fornisce un valore legale di avvenuta notifica."
    ],
    "corretta": "Sincronizza lo stato della posta elettronica su tutti i dispositivi (PC, telefono)."
  },
  {
    "domanda": "Cosa si intende per 'Phishing'?",
    "risposte": [
      "Una tecnica per crittografare tutti i file del computer (Ransomware).",
      "Una truffa che simula una comunicazione di un ente fidato (Banca, Poste) per rubare le credenziali su un sito clone.",
      "Un errore del browser che impedisce la visualizzazione delle immagini."
    ],
    "corretta": "Una truffa che simula una comunicazione di un ente fidato (Banca, Poste) per rubare le credenziali su un sito clone."
  },
  {
    "domanda": "Il Metodo 'Inbox Zero' suggerisce di elaborare ogni email una sola volta con una di queste azioni, tranne:",
    "risposte": [
      "Rispondere immediatamente (Do) se l'azione richiede meno di due minuti.",
      "Cancellare (Delete) se il messaggio è inutile.",
      "Lasciare la mail non letta in Posta in Arrivo per riesaminarla in seguito."
    ],
    "corretta": "Lasciare la mail non letta in Posta in Arrivo per riesaminarla in seguito."
  },
  {
    "domanda": "Il Domicilio Digitale (che può essere una PEC) per il cittadino è l'indirizzo scelto per:",
    "risposte": [
      "Scambiare messaggi con i colleghi di lavoro.",
      "Ricevere tutte le comunicazioni aventi valore legale (es. multe, accertamenti) dalla Pubblica Amministrazione.",
      "Richiedere l'emissione della Carta d'Identità Elettronica (CIE)."
    ],
    "corretta": "Ricevere tutte le comunicazioni aventi valore legale (es. multe, accertamenti) dalla Pubblica Amministrazione."
  },
  {
    "domanda": "Qual è il principale requisito di sicurezza che sarà obbligatorio per l'accesso alla nuova PEC Europea (REM)?",
    "risposte": [
      "L'uso di una password di massimo 8 caratteri.",
      "L'uso esclusivo di un hard disk esterno come sistema di backup.",
      "L'Autenticazione a Due Fattori (2FA) tramite password e codice monouso (OTP)."
    ],
    "corretta": "L'Autenticazione a Due Fattori (2FA) tramite password e codice monouso (OTP)."
  },
  {
    "domanda": "Perché si utilizza la Marca Temporale su un documento firmato digitalmente?",
    "risposte": [
      "Per ridurre la dimensione del file e facilitarne l'invio via email.",
      "Per estendere la validità legale della firma nel tempo, associando una data e ora certa al documento.",
      "Per convertire il documento firmato in formato PDF/A."
    ],
    "corretta": "Per estendere la validità legale della firma nel tempo, associando una data e ora certa al documento."
  },
  {
    "domanda": "In quale caso salvare le fatture elettroniche in una cartella del PC non è considerato 'Conservazione a Norma'?",
    "risposte": [
      "Sempre, perché la conservazione a norma è un processo informatico che garantisce integrità e leggibilità per legge.",
      "Solo se il PC non è protetto da un antivirus aggiornato.",
      "Mai, l'archiviazione locale è sempre sufficiente per la legge italiana."
    ],
    "corretta": "Sempre, perché la conservazione a norma è un processo informatico che garantisce integrità e leggibilità per legge."
  },
  {
    "domanda": "Quale sistema ha permesso di unificare le anagrafi dei singoli Comuni in un'unica banca dati nazionale, migliorando i servizi per il cittadino?",
    "risposte": [
      "PagoPA",
      "ANPR (Anagrafe Nazionale della Popolazione Residente)",
      "FSE (Fascicolo Sanitario Elettronico)"
    ],
    "corretta": "ANPR (Anagrafe Nazionale della Popolazione Residente)"
  },
  {
    "domanda": "Qual è la funzione principale del sistema PagoPA?",
    "risposte": [
      "Identificare i cittadini per l'accesso ai servizi pubblici.",
      "Gestire i pagamenti verso la Pubblica Amministrazione in modo standardizzato e sicuro.",
      "Fornire il Fascicolo Sanitario Elettronico."
    ],
    "corretta": "Gestire i pagamenti verso la Pubblica Amministrazione in modo standardizzato e sicuro."
  },
  {
    "domanda": "Qual è il meccanismo di autenticazione richiesto dal Livello 2 dello SPID?",
    "risposte": [
      "Solo nome utente e password.",
      "Password e un codice monouso (OTP) inviato tramite SMS o App.",
      "Password e l'uso di una Smart Card con lettore."
    ],
    "corretta": "Password e un codice monouso (OTP) inviato tramite SMS o App."
  },
  {
    "domanda": "Cosa garantisce il pilastro della 'Confidentiality' (Riservatezza) nella Triade CIA della Cybersecurity?",
    "risposte": [
      "Che i servizi e i dati siano sempre accessibili (Disponibilità).",
      "Che i dati siano accessibili solo a chi è autorizzato (tramite crittografia e password).",
      "Che i dati non siano stati alterati o corrotti (Integrità)."
    ],
    "corretta": "Che i dati siano accessibili solo a chi è autorizzato (tramite crittografia e password)."
  },
  {
    "domanda": "Qual è la raccomandazione principale della regola 3-2-1 del backup?",
    "risposte": [
      "Avere almeno 3 copie totali dei dati, su 2 supporti diversi, con 1 copia mantenuta in un luogo esterno (off-site).",
      "Eseguire il backup almeno 3 volte al giorno.",
      "Conservare i dati per 3 anni, 2 mesi e 1 giorno."
    ],
    "corretta": "Avere almeno 3 copie totali dei dati, su 2 supporti diversi, con 1 copia mantenuta in un luogo esterno (off-site)."
  },
  {
    "domanda": "Quando è particolarmente consigliato l'uso di una VPN (Virtual Private Network)?",
    "risposte": [
      "Quando si usa il computer solo per guardare video in locale.",
      "Quando si lavora da casa con la propria connessione privata.",
      "Quando ci si connette a una rete Wi-Fi pubblica non sicura (es. bar, aeroporto)."
    ],
    "corretta": "Quando ci si connette a una rete Wi-Fi pubblica non sicura (es. bar, aeroporto)."
  }
]
