[
  {
    "domanda": "Qual è la funzione del protocollo HTTP che ha permesso lo sviluppo del World Wide Web (WWW) a partire dal 1991?",
    "risposte": [
      "È il protocollo che assegna gli indirizzi IP ai computer.",
      "È il protocollo specifico per il trasferimento di dati ipertestuali (pagine web).",
      "È il protocollo che garantisce la sicurezza dei pagamenti online."
    ],
    "corretta": "È il protocollo specifico per il trasferimento di dati ipertestuali (pagine web)."
  },
  {
    "domanda": "Quale di queste affermazioni è vera riguardo alla differenza tra Internet e WWW?",
    "risposte": [
      "Non c'è differenza, i due termini sono sinonimi in ogni contesto.",
      "Internet è l'infrastruttura fisica (i cavi e le reti), il WWW è un servizio che viaggia su di essa (le pagine web).",
      "Il WWW è la parte più grande e non indicizzata (Deep Web), Internet è la parte visibile."
    ],
    "corretta": "Internet è l'infrastruttura fisica (i cavi e le reti), il WWW è un servizio che viaggia su di essa (le pagine web)."
  },
  {
    "domanda": "Quale vantaggio offre la Fibra Ottica rispetto ai cavi in rame (Ethernet)?",
    "risposte": [
      "È più economica da installare su brevi distanze.",
      "È immune alle interferenze elettromagnetiche e copre grandi distanze.",
      "Trasporta segnali elettrici ad alta tensione."
    ],
    "corretta": "È immune alle interferenze elettromagnetiche e copre grandi distanze."
  },
  {
    "domanda": "Un motore di ricerca è un sito web che serve a trovare altri siti web. Qual è il processo che permette al motore di ricerca di catalogare i contenuti?",
    "risposte": [
      "La traduzione del codice HTML (HyperText Markup Language).",
      "Il Crawling (scansione) e l'Indexing (indicizzazione) delle pagine.",
      "La visualizzazione delle pagine da parte del browser."
    ],
    "corretta": "Il Crawling (scansione) e l'Indexing (indicizzazione) delle pagine."
  },
  {
    "domanda": "Qual è lo scopo del certificato SSL/TLS che garantisce la presenza del protocollo HTTPS?",
    "risposte": [
      "Accelerare la velocità di caricamento della pagina web.",
      "Crittografare la connessione per proteggere i dati che l'utente inserisce nel sito.",
      "Fornire all'utente un antivirus integrato nel browser."
    ],
    "corretta": "Crittografare la connessione per proteggere i dati che l'utente inserisce nel sito."
  },
  {
    "domanda": "Qual è il significato del campo 'Oggetto' in una email?",
    "risposte": [
      "È un campo facoltativo che serve solo per l'archiviazione.",
      "È lo scopo o il motivo del messaggio, fondamentale per l'archiviazione e l'urgenza.",
      "È il campo in cui si inseriscono gli indirizzi in copia conoscenza."
    ],
    "corretta": "È lo scopo o il motivo del messaggio, fondamentale per l'archiviazione e l'urgenza."
  },
  {
    "domanda": "Se invii una mail a un gruppo di persone in CC (Copia Conoscenza), gli indirizzi sono:",
    "risposte": [
      "Invisibili agli altri destinatari, per motivi di privacy.",
      "Visibili a tutti i destinatari inclusi quelli in A e in CC.",
      "Visibili solo al mittente, ma non al destinatario principale."
    ],
    "corretta": "Visibili a tutti i destinatari inclusi quelli in A e in CC."
  },
  {
    "domanda": "Qual è il principale svantaggio della Posta Elettronica Certificata (PEC) nel contesto internazionale?",
    "risposte": [
      "Non ha la Marca Temporale.",
      "La sua validità legale è limitata al territorio italiano e non è riconosciuta come standard UE.",
      "Non permette l'invio di allegati."
    ],
    "corretta": "La sua validità legale è limitata al territorio italiano e non è riconosciuta come standard UE."
  },
  {
    "domanda": "Chi è l'organo pubblico italiano preposto alla vigilanza e al coordinamento dei gestori di servizi digitali come la PEC e la Firma Digitale?",
    "risposte": [
      "Il Ministero delle Imprese e del Made in Italy (MIMIT).",
      "L'Autorità Garante della Concorrenza e del Mercato (AGCM).",
      "L'Agenzia per l'Italia Digitale (AGID)."
    ],
    "corretta": "L'Agenzia per l'Italia Digitale (AGID)."
  },
  {
    "domanda": "Quale informazione *non* è certificata dalla Ricevuta di Consegna di una PEC?",
    "risposte": [
      "La data e l'ora esatta del deposito del messaggio nella casella del destinatario.",
      "L'indirizzo PEC del mittente e del destinatario.",
      "Il fatto che il destinatario abbia effettivamente aperto e letto il contenuto del messaggio."
    ],
    "corretta": "Il fatto che il destinatario abbia effettivamente aperto e letto il contenuto del messaggio."
  },
  {
    "domanda": "Cosa si intende per 'Indirizzo PEC delle Imprese e dei Professionisti'?",
    "risposte": [
      "Un indirizzo email ordinario (es. Gmail) usato per comunicazioni formali.",
      "L'indirizzo PEC rintracciabile gratuitamente tramite il registro pubblico INI-PEC.",
      "L'indirizzo PEC del titolare non è mai rintracciabile online per legge."
    ],
    "corretta": "L'indirizzo PEC rintracciabile gratuitamente tramite il registro pubblico INI-PEC."
  },
  {
    "domanda": "Qual è il principale limite di sicurezza della PEC che verrà superato dallo standard europeo REM?",
    "risposte": [
      "La sua lentezza nell'invio di messaggi.",
      "Il fatto che l'identità del proprietario dell'indirizzo PEC non è verificata.",
      "La mancanza di un oggetto nel messaggio."
    ],
    "corretta": "Il fatto che l'identità del proprietario dell'indirizzo PEC non è verificata."
  },
  {
    "domanda": "Qual è un vantaggio offerto dalla PEC rispetto alla raccomandata cartacea A/R?",
    "risposte": [
      "Costo sempre maggiore e tempi di consegna più lunghi.",
      "Certifica la trasmissione e può certificare il contenuto della comunicazione, inclusi gli allegati.",
      "Richiede sempre l'uso di una busta fisica."
    ],
    "corretta": "Certifica la trasmissione e può certificare il contenuto della comunicazione, inclusi gli allegati."
  },
  {
    "domanda": "Perché è importante monitorare regolarmente la propria casella PEC?",
    "risposte": [
      "Per inviare messaggi pubblicitari (spam).",
      "Per evitare che scada la connessione Internet.",
      "Per evitare il decorso di eventuali termini legali: la notifica è valida appena il messaggio è depositato (compiuta giacenza)."
    ],
    "corretta": "Per evitare il decorso di eventuali termini legali: la notifica è valida appena il messaggio è depositato (compiuta giacenza)."
  },
  {
    "domanda": "Cosa si intende per 'Autenticazione a Due Fattori' (2FA), che sarà obbligatoria per la PEC Europea (REM)?",
    "risposte": [
      "Accedere solo con la password, ma da due dispositivi diversi.",
      "Accedere con Password e un secondo elemento di verifica (es. un codice monouso OTP o biometria).",
      "Accedere solo tramite la carta d'identità elettronica."
    ],
    "corretta": "Accedere con Password e un codice monouso (OTP) o biometria."
  },
  {
    "domanda": "Qual è l'obiettivo principale del sistema SPID (Sistema Pubblico di Identità Digitale)?",
    "risposte": [
      "Fornire un servizio di posta elettronica certificata (PEC) gratuito.",
      "Unificare l'accesso a tutti i servizi pubblici digitali (PA) con un'unica chiave d'accesso.",
      "Sostituire completamente la Carta d'Identità Elettronica (CIE)."
    ],
    "corretta": "Unificare l'accesso a tutti i servizi pubblici digitali (PA) con un'unica chiave d'accesso."
  },
  {
    "domanda": "Cosa rende la Carta d'Identità Elettronica (CIE) uno strumento di autenticazione di alto livello (Livello 3)?",
    "risposte": [
      "La sua forma fisica e la necessità di un lettore (o di un telefono con NFC) per leggere il chip.",
      "Il fatto che è gestita da Identity Provider privati come Poste Italiane.",
      "La sua integrazione con tutti i social media."
    ],
    "corretta": "La sua forma fisica e la necessità di un lettore (o di un telefono con NFC) per leggere il chip."
  },
  {
    "domanda": "Quale protocollo di sicurezza garantisce che i dati non siano accessibili a chi non è autorizzato (Riservatezza)?",
    "risposte": [
      "Il protocollo DNS.",
      "L'utilizzo della crittografia e delle password.",
      "La ridondanza dei server e l'uso di un backup."
    ],
    "corretta": "L'utilizzo della crittografia e delle password."
  },
  {
    "domanda": "Cos'è un Trojan Horse nel contesto della sicurezza informatica?",
    "risposte": [
      "Un malware che si diffonde autonomamente nella rete.",
      "Un software che sembra utile (es. un gioco) ma che nasconde un codice dannoso (es. una backdoor per gli hacker).",
      "Un sistema di protezione della posta elettronica."
    ],
    "corretta": "Un software che sembra utile (es. un gioco) ma che nasconde un codice dannoso (es. una backdoor per gli hacker)."
  },
  {
    "domanda": "L'attacco Ransomware si basa sull'azione di:",
    "risposte": [
      "Rubare i dati personali tramite un sito web clone.",
      "Bloccare e cifrare tutti i file del computer per chiedere un riscatto.",
      "Inviare email massive di spam e pubblicità."
    ],
    "corretta": "Bloccare e cifrare tutti i file del computer per chiedere un riscatto."
  },
  {
    "domanda": "L'Ingegneria Sociale è una tecnica utilizzata dagli hacker per:",
    "risposte": [
      "Ottimizzare il proprio sito web per i motori di ricerca.",
      "Sfruttare vulnerabilità nel software del computer.",
      "Manipolare psicologicamente le persone per ottenere informazioni riservate (es. password)."
    ],
    "corretta": "Manipolare psicologicamente le persone per ottenere informazioni riservate (es. password)."
  },
  {
    "domanda": "Qual è il principale beneficio di utilizzare una VPN (Virtual Private Network)?",
    "risposte": [
      "Garantire che il tuo browser non salvi la cronologia.",
      "Creare un 'tunnel' cifrato per proteggere i dati, specialmente su reti Wi-Fi pubbliche.",
      "Rendere il computer immune ai virus e ai malware."
    ],
    "corretta": "Creare un 'tunnel' cifrato per proteggere i dati, specialmente su reti Wi-Fi pubbliche."
  },
  {
    "domanda": "La regola 3-2-1 del backup raccomanda di mantenere almeno quante copie totali dei dati e su quanti supporti diversi?",
    "risposte": [
      "2 copie su 1 supporto diverso.",
      "3 copie su 2 supporti diversi, con 1 copia off-site.",
      "3 copie solo su hard disk esterno."
    ],
    "corretta": "3 copie su 2 supporti diversi, con 1 copia off-site."
  },
  {
    "domanda": "Cosa sono i 'Cookie di Profilazione' che richiedono il consenso esplicito dell'utente (Cookie Law)?",
    "risposte": [
      "File di testo indispensabili per il funzionamento tecnico del sito (es. carrello).",
      "File utilizzati per tracciare il comportamento dell'utente e creare profili pubblicitari mirati.",
      "Piccoli software che infettano il computer con malware."
    ],
    "corretta": "File utilizzati per tracciare il comportamento dell'utente e creare profili pubblicitari mirati."
  },
  {
    "domanda": "Qual è lo strumento primario per il Personal Branding e il networking professionale?",
    "risposte": [
      "TikTok.",
      "LinkedIn.",
      "Pinterest."
    ],
    "corretta": "LinkedIn."
  },
  {
    "domanda": "Qual è il principale rischio legato ai dispositivi dell'Internet of Things (IoT)?",
    "risposte": [
      "Consumano troppa energia elettrica.",
      "Hanno spesso software poco protetti e sono usati dagli hacker per creare reti di attacco (Botnet).",
      "Non sono compatibili con la connessione 4G."
    ],
    "corretta": "Hanno spesso software poco protetti e sono usati dagli hacker per creare reti di attacco (Botnet)."
  },
  {
    "domanda": "Qual è la differenza tra l'uso del campo CC (Copia Conoscenza) e il campo A (Destinatario diretto)?",
    "risposte": [
      "Il CC serve solo per allegare documenti.",
      "I destinatari in A devono agire o rispondere; quelli in CC devono solo essere informati.",
      "Non c'è differenza; il campo A è obsoleto."
    ],
    "corretta": "I destinatari in A devono agire o rispondere; quelli in CC devono solo essere informati."
  },
  {
    "domanda": "Qual è il principale svantaggio dell'utilizzo della Webmail (es. Gmail) rispetto a un Client Desktop (es. Outlook)?",
    "risposte": [
      "È un servizio a pagamento.",
      "Richiede una connessione Internet attiva per funzionare pienamente e accedere ai messaggi.",
      "Non permette di inviare allegati."
    ],
    "corretta": "Richiede una connessione Internet attiva per funzionare pienamente e accedere ai messaggi."
  },
  {
    "domanda": "Qual è la regola fondamentale della Netiquette (galateo digitale) da rispettare durante una videoconferenza?",
    "risposte": [
      "Tenere sempre la telecamera spenta.",
      "Non usare mai le cuffie con microfono.",
      "Mantenere il microfono in Muto quando non si parla, per evitare rumori di fondo."
    ],
    "corretta": "Mantenere il microfono in Muto quando non si parla, per evitare rumori di fondo."
  },
  {
    "domanda": "Perché è preferibile usare l'Intelligenza Artificiale Generativa (es. Gemini) per scrivere una bozza di email o un riassunto, piuttosto che un motore di ricerca?",
    "risposte": [
      "Perché genera contenuti originali e non solo elenca pagine esistenti.",
      "Perché garantisce la sicurezza totale dei dati aziendali.",
      "Perché è l'unico strumento che funziona senza connessione internet."
    ],
    "corretta": "Perché genera contenuti originali e non solo elenca pagine esistenti."
  }
]
